Tekla Open API Reference for Tekla Structures 2025
AnalysisVolumeItem Methods
The AnalysisVolumeItem type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis volume item. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisVolumeItem Class
Tekla.Structures.Analysis Namespace